gillwei/XMAX_rt1172/board/pin_mux.c
  /* GPIO configuration of HW_ID1 on GPIO_EMC_B2_04 (pin M1) */
  gpio_pin_config_t HW_ID1_config = {
      .direction = kGPIO_DigitalInput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_EMC_B2_04 (pin M1) */
  GPIO_PinInit(GPIO8, 14U, &HW_ID1_config);

  /* GPIO configuration of HW_ID2 on GPIO_EMC_B2_05 (pin N1) */
  gpio_pin_config_t HW_ID2_config = {
      .direction = kGPIO_DigitalInput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_EMC_B2_05 (pin N1) */
  GPIO_PinInit(GPIO8, 15U, &HW_ID2_config);

  /* GPIO configuration of HW_ID3 on GPIO_EMC_B2_08 (pin P1) */
  gpio_pin_config_t HW_ID3_config = {
      .direction = kGPIO_DigitalInput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_EMC_B2_08 (pin P1) */
  GPIO_PinInit(GPIO8, 18U, &HW_ID3_config);

  /* GPIO configuration of SKU_ID0 on GPIO_EMC_B2_09 (pin N2) */
  gpio_pin_config_t SKU_ID0_config = {
      .direction = kGPIO_DigitalInput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_EMC_B2_09 (pin N2) */
  GPIO_PinInit(GPIO8, 19U, &SKU_ID0_config);

  /* GPIO configuration of SKU_ID1 on GPIO_EMC_B2_10 (pin R2) */
  gpio_pin_config_t SKU_ID1_config = {
      .direction = kGPIO_DigitalInput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_EMC_B2_10 (pin R2) */
  GPIO_PinInit(GPIO8, 20U, &SKU_ID1_config);

  /* GPIO configuration of SKU_ID2 on GPIO_EMC_B2_12 (pin M2) */
  gpio_pin_config_t SKU_ID2_config = {
      .direction = kGPIO_DigitalInput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_EMC_B2_12 (pin M2) */
  GPIO_PinInit(GPIO8, 22U, &SKU_ID2_config);

  /* GPIO configuration of SKU_ID3 on GPIO_EMC_B2_16 (pin P2) */
  gpio_pin_config_t SKU_ID3_config = {
      .direction = kGPIO_DigitalInput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_EMC_B2_16 (pin P2) */
  GPIO_PinInit(GPIO8, 26U, &SKU_ID3_config);

  /* GPIO configuration of WDOG_B on GPIO_AD_04 (pin M13) */
  gpio_pin_config_t WDOG_B_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_AD_04 (pin M13) */
  GPIO_PinInit(GPIO9, 3U, &WDOG_B_config);

  /* GPIO configuration of BT_RST_N on GPIO_AD_08 (pin R15) */
  gpio_pin_config_t BT_RST_N_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 1U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_AD_08 (pin R15) */
  GPIO_PinInit(GPIO9, 7U, &BT_RST_N_config);

  /* GPIO configuration of VDD_3V3ON_PGOOD on GPIO_AD_09 (pin R16) */
  gpio_pin_config_t VDD_3V3ON_PGOOD_config = {
      .direction = kGPIO_DigitalInput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_AD_09 (pin R16) */
  GPIO_PinInit(GPIO9, 8U, &VDD_3V3ON_PGOOD_config);

  /* GPIO configuration of VDD_3V3_PGOOD on GPIO_AD_10 (pin R17) */
  gpio_pin_config_t VDD_3V3_PGOOD_config = {
      .direction = kGPIO_DigitalInput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_AD_10 (pin R17) */
  GPIO_PinInit(GPIO9, 9U, &VDD_3V3_PGOOD_config);

  /* GPIO configuration of CAN_PGOOD on GPIO_AD_11 (pin P16) */
  gpio_pin_config_t CAN_PGOOD_config = {
      .direction = kGPIO_DigitalInput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_AD_11 (pin P16) */
  GPIO_PinInit(GPIO9, 10U, &CAN_PGOOD_config);

  /* GPIO configuration of CAN_EN on GPIO_AD_27 (pin N16) */
  gpio_pin_config_t CAN_EN_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 1U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_AD_27 (pin N16) */
  GPIO_PinInit(GPIO9, 26U, &CAN_EN_config);

  /* GPIO configuration of CAN_STBY on GPIO_AD_28 (pin L17) */
  gpio_pin_config_t CAN_STBY_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_AD_28 (pin L17) */
  GPIO_PinInit(GPIO9, 27U, &CAN_STBY_config);

  /* GPIO configuration of TFT_BL_EN on GPIO_SD_B1_00 (pin B16) */
  gpio_pin_config_t TFT_BL_EN_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 1U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_SD_B1_00 (pin B16) */
  GPIO_PinInit(GPIO10, 3U, &TFT_BL_EN_config);

  /* GPIO configuration of TFT_ASIL on GPIO_SD_B1_01 (pin D15) */
  gpio_pin_config_t TFT_ASIL_config = {
      .direction = kGPIO_DigitalInput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_SD_B1_01 (pin D15) */
  GPIO_PinInit(GPIO10, 4U, &TFT_ASIL_config);

  /* GPIO configuration of TFT_CONNECTED on GPIO_SD_B1_02 (pin C15) */
  gpio_pin_config_t TFT_CONNECTED_config = {
      .direction = kGPIO_DigitalInput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_SD_B1_02 (pin C15) */
  GPIO_PinInit(GPIO10, 5U, &TFT_CONNECTED_config);

  /* GPIO configuration of TFT_RESET on GPIO_SD_B1_03 (pin B17) */
  gpio_pin_config_t TFT_RESET_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_SD_B1_03 (pin B17) */
  GPIO_PinInit(GPIO10, 6U, &TFT_RESET_config);

  /* GPIO configuration of DEBUG_LED on GPIO_SD_B2_01 (pin J14) */
  gpio_pin_config_t DEBUG_LED_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_SD_B2_01 (pin J14) */
  GPIO_PinInit(GPIO10, 10U, &DEBUG_LED_config);

  /* GPIO configuration of IGN_WAKE on WAKEUP_DIG (pin T8) */
  gpio_pin_config_t IGN_WAKE_config = {
      .direction = kGPIO_DigitalInput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_IntFallingEdge
  };
  /* Initialize GPIO functionality on WAKEUP_DIG (pin T8) */
  GPIO_PinInit(GPIO13, 0U, &IGN_WAKE_config);
  /* Enable GPIO pin interrupt on WAKEUP_DIG (pin T8) */
  GPIO_PortEnableInterrupts(GPIO13, 1U << 0U);

