gillwei/XMAX_rt1172/board/pin_mux.c
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitLcdifPins:
- options: {callFromInitBoot: 'false', coreID: cm7, enableClock: 'true'}
- pin_list:
  - {pin_num: E13, peripheral: LCDIF, signal: lcdif_clk, pin_signal: GPIO_DISP_B1_00, pull_down_pull_up_config: Pull_Up, pdrv_config: Normal_Driver}
  - {pin_num: E10, peripheral: LCDIF, signal: 'lcdif_data, 00', pin_signal: GPIO_DISP_B1_04, pull_down_pull_up_config: Pull_Up, pdrv_config: Normal_Driver}
  - {pin_num: C11, peripheral: LCDIF, signal: 'lcdif_data, 01', pin_signal: GPIO_DISP_B1_05, pull_down_pull_up_config: Pull_Up, pdrv_config: Normal_Driver}
  - {pin_num: D10, peripheral: LCDIF, signal: 'lcdif_data, 02', pin_signal: GPIO_DISP_B1_06, pull_down_pull_up_config: Pull_Up, pdrv_config: Normal_Driver}
  - {pin_num: E12, peripheral: LCDIF, signal: 'lcdif_data, 03', pin_signal: GPIO_DISP_B1_07, pull_down_pull_up_config: Pull_Up, pdrv_config: Normal_Driver}
  - {pin_num: A15, peripheral: LCDIF, signal: 'lcdif_data, 04', pin_signal: GPIO_DISP_B1_08, pull_down_pull_up_config: Pull_Up, pdrv_config: Normal_Driver}
  - {pin_num: C13, peripheral: LCDIF, signal: 'lcdif_data, 05', pin_signal: GPIO_DISP_B1_09, pull_down_pull_up_config: Pull_Up, pdrv_config: Normal_Driver}
  - {pin_num: B14, peripheral: LCDIF, signal: 'lcdif_data, 06', pin_signal: GPIO_DISP_B1_10, pull_down_pull_up_config: Pull_Up, pdrv_config: Normal_Driver}
  - {pin_num: A14, peripheral: LCDIF, signal: 'lcdif_data, 07', pin_signal: GPIO_DISP_B1_11, pull_down_pull_up_config: Pull_Up, pdrv_config: Normal_Driver}
  - {pin_num: E8, peripheral: LCDIF, signal: 'lcdif_data, 08', pin_signal: GPIO_DISP_B2_00, pull_up_down_config: Pull_Up, drive_strength: Normal}
  - {pin_num: F8, peripheral: LCDIF, signal: 'lcdif_data, 09', pin_signal: GPIO_DISP_B2_01, pull_up_down_config: Pull_Up, drive_strength: Normal}
  - {pin_num: E9, peripheral: LCDIF, signal: 'lcdif_data, 10', pin_signal: GPIO_DISP_B2_02, pull_up_down_config: Pull_Up, drive_strength: Normal}
  - {pin_num: D7, peripheral: LCDIF, signal: 'lcdif_data, 11', pin_signal: GPIO_DISP_B2_03, pull_up_down_config: Pull_Up, drive_strength: Normal}
  - {pin_num: C7, peripheral: LCDIF, signal: 'lcdif_data, 12', pin_signal: GPIO_DISP_B2_04, pull_up_down_config: Pull_Up, drive_strength: Normal}
  - {pin_num: C9, peripheral: LCDIF, signal: 'lcdif_data, 13', pin_signal: GPIO_DISP_B2_05, pull_up_down_config: Pull_Up, drive_strength: Normal}
  - {pin_num: C6, peripheral: LCDIF, signal: 'lcdif_data, 14', pin_signal: GPIO_DISP_B2_06, pull_up_down_config: Pull_Up, drive_strength: Normal}
  - {pin_num: D6, peripheral: LCDIF, signal: 'lcdif_data, 15', pin_signal: GPIO_DISP_B2_07, pull_up_down_config: Pull_Up, drive_strength: Normal}
  - {pin_num: B5, peripheral: LCDIF, signal: 'lcdif_data, 16', pin_signal: GPIO_DISP_B2_08, pull_up_down_config: Pull_Up, drive_strength: Normal}
  - {pin_num: D8, peripheral: LCDIF, signal: 'lcdif_data, 17', pin_signal: GPIO_DISP_B2_09, pull_up_down_config: Pull_Up, drive_strength: Normal}
  - {pin_num: D9, peripheral: LCDIF, signal: 'lcdif_data, 18', pin_signal: GPIO_DISP_B2_10, pull_up_down_config: Pull_Up, drive_strength: Normal}
  - {pin_num: A6, peripheral: LCDIF, signal: 'lcdif_data, 19', pin_signal: GPIO_DISP_B2_11, pull_up_down_config: Pull_Up, drive_strength: Normal}
  - {pin_num: B6, peripheral: LCDIF, signal: 'lcdif_data, 20', pin_signal: GPIO_DISP_B2_12, pull_up_down_config: Pull_Up, drive_strength: Normal}
  - {pin_num: A5, peripheral: LCDIF, signal: 'lcdif_data, 21', pin_signal: GPIO_DISP_B2_13, pull_up_down_config: Pull_Up, drive_strength: Normal}
  - {pin_num: A7, peripheral: LCDIF, signal: 'lcdif_data, 22', pin_signal: GPIO_DISP_B2_14, pull_up_down_config: Pull_Up, drive_strength: Normal}
  - {pin_num: D11, peripheral: LCDIF, signal: lcdif_hsync, pin_signal: GPIO_DISP_B1_02, pdrv_config: Normal_Driver}
  - {pin_num: E11, peripheral: LCDIF, signal: lcdif_vsync, pin_signal: GPIO_DISP_B1_03, pdrv_config: Normal_Driver}
  - {pin_num: D13, peripheral: LCDIF, signal: lcdif_enable, pin_signal: GPIO_DISP_B1_01, pdrv_config: Normal_Driver}
  - {pin_num: A4, peripheral: LCDIF, signal: 'lcdif_data, 23', pin_signal: GPIO_DISP_B2_15, drive_strength: Normal}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitLcdifPins, assigned for the Cortex-M7F core.
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitLcdifPins(void) {
  CLOCK_EnableClock(kCLOCK_Iomuxc);           /* LPCG on: LPCG is ON. */

  IOMUXC_SetPinMux(
      IOMUXC_GPIO_DISP_B1_00_VIDEO_MUX_LCDIF_CLK,  /* GPIO_DISP_B1_00 is configured as VIDEO_MUX_LCDIF_CLK */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_DISP_B1_01_VIDEO_MUX_LCDIF_ENABLE,  /* GPIO_DISP_B1_01 is configured as VIDEO_MUX_LCDIF_ENABLE */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_DISP_B1_02_VIDEO_MUX_LCDIF_HSYNC,  /* GPIO_DISP_B1_02 is configured as VIDEO_MUX_LCDIF_HSYNC */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_DISP_B1_03_VIDEO_MUX_LCDIF_VSYNC,  /* GPIO_DISP_B1_03 is configured as VIDEO_MUX_LCDIF_VSYNC */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_DISP_B1_04_VIDEO_MUX_LCDIF_DATA00,  /* GPIO_DISP_B1_04 is configured as VIDEO_MUX_LCDIF_DATA00 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_DISP_B1_05_VIDEO_MUX_LCDIF_DATA01,  /* GPIO_DISP_B1_05 is configured as VIDEO_MUX_LCDIF_DATA01 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_DISP_B1_06_VIDEO_MUX_LCDIF_DATA02,  /* GPIO_DISP_B1_06 is configured as VIDEO_MUX_LCDIF_DATA02 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_DISP_B1_07_VIDEO_MUX_LCDIF_DATA03,  /* GPIO_DISP_B1_07 is configured as VIDEO_MUX_LCDIF_DATA03 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_DISP_B1_08_VIDEO_MUX_LCDIF_DATA04,  /* GPIO_DISP_B1_08 is configured as VIDEO_MUX_LCDIF_DATA04 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_DISP_B1_09_VIDEO_MUX_LCDIF_DATA05,  /* GPIO_DISP_B1_09 is configured as VIDEO_MUX_LCDIF_DATA05 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_DISP_B1_10_VIDEO_MUX_LCDIF_DATA06,  /* GPIO_DISP_B1_10 is configured as VIDEO_MUX_LCDIF_DATA06 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_DISP_B1_11_VIDEO_MUX_LCDIF_DATA07,  /* GPIO_DISP_B1_11 is configured as VIDEO_MUX_LCDIF_DATA07 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_DISP_B2_00_VIDEO_MUX_LCDIF_DATA08,  /* GPIO_DISP_B2_00 is configured as VIDEO_MUX_LCDIF_DATA08 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_DISP_B2_01_VIDEO_MUX_LCDIF_DATA09,  /* GPIO_DISP_B2_01 is configured as VIDEO_MUX_LCDIF_DATA09 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_DISP_B2_02_VIDEO_MUX_LCDIF_DATA10,  /* GPIO_DISP_B2_02 is configured as VIDEO_MUX_LCDIF_DATA10 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_DISP_B2_03_VIDEO_MUX_LCDIF_DATA11,  /* GPIO_DISP_B2_03 is configured as VIDEO_MUX_LCDIF_DATA11 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_DISP_B2_04_VIDEO_MUX_LCDIF_DATA12,  /* GPIO_DISP_B2_04 is configured as VIDEO_MUX_LCDIF_DATA12 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_DISP_B2_05_VIDEO_MUX_LCDIF_DATA13,  /* GPIO_DISP_B2_05 is configured as VIDEO_MUX_LCDIF_DATA13 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_DISP_B2_06_VIDEO_MUX_LCDIF_DATA14,  /* GPIO_DISP_B2_06 is configured as VIDEO_MUX_LCDIF_DATA14 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_DISP_B2_07_VIDEO_MUX_LCDIF_DATA15,  /* GPIO_DISP_B2_07 is configured as VIDEO_MUX_LCDIF_DATA15 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_DISP_B2_08_VIDEO_MUX_LCDIF_DATA16,  /* GPIO_DISP_B2_08 is configured as VIDEO_MUX_LCDIF_DATA16 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_DISP_B2_09_VIDEO_MUX_LCDIF_DATA17,  /* GPIO_DISP_B2_09 is configured as VIDEO_MUX_LCDIF_DATA17 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_DISP_B2_10_VIDEO_MUX_LCDIF_DATA18,  /* GPIO_DISP_B2_10 is configured as VIDEO_MUX_LCDIF_DATA18 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_DISP_B2_11_VIDEO_MUX_LCDIF_DATA19,  /* GPIO_DISP_B2_11 is configured as VIDEO_MUX_LCDIF_DATA19 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_DISP_B2_12_VIDEO_MUX_LCDIF_DATA20,  /* GPIO_DISP_B2_12 is configured as VIDEO_MUX_LCDIF_DATA20 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_DISP_B2_13_VIDEO_MUX_LCDIF_DATA21,  /* GPIO_DISP_B2_13 is configured as VIDEO_MUX_LCDIF_DATA21 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_DISP_B2_14_VIDEO_MUX_LCDIF_DATA22,  /* GPIO_DISP_B2_14 is configured as VIDEO_MUX_LCDIF_DATA22 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_DISP_B2_15_VIDEO_MUX_LCDIF_DATA23,  /* GPIO_DISP_B2_15 is configured as VIDEO_MUX_LCDIF_DATA23 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_DISP_B1_00_VIDEO_MUX_LCDIF_CLK,  /* GPIO_DISP_B1_00 PAD functional properties : */
      0x06U);                                 /* PDRV Field: normal driver
                                                 Pull Down Pull Up Field: PU
                                                 Open Drain Field: Disabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_DISP_B1_01_VIDEO_MUX_LCDIF_ENABLE,  /* GPIO_DISP_B1_01 PAD functional properties : */
      0x0AU);                                 /* PDRV Field: normal driver
                                                 Pull Down Pull Up Field: PD
                                                 Open Drain Field: Disabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_DISP_B1_02_VIDEO_MUX_LCDIF_HSYNC,  /* GPIO_DISP_B1_02 PAD functional properties : */
      0x0AU);                                 /* PDRV Field: normal driver
                                                 Pull Down Pull Up Field: PD
                                                 Open Drain Field: Disabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_DISP_B1_03_VIDEO_MUX_LCDIF_VSYNC,  /* GPIO_DISP_B1_03 PAD functional properties : */
      0x0AU);                                 /* PDRV Field: normal driver
                                                 Pull Down Pull Up Field: PD
                                                 Open Drain Field: Disabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_DISP_B1_04_VIDEO_MUX_LCDIF_DATA00,  /* GPIO_DISP_B1_04 PAD functional properties : */
      0x06U);                                 /* PDRV Field: normal driver
                                                 Pull Down Pull Up Field: PU
                                                 Open Drain Field: Disabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_DISP_B1_05_VIDEO_MUX_LCDIF_DATA01,  /* GPIO_DISP_B1_05 PAD functional properties : */
      0x06U);                                 /* PDRV Field: normal driver
                                                 Pull Down Pull Up Field: PU
                                                 Open Drain Field: Disabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_DISP_B1_06_VIDEO_MUX_LCDIF_DATA02,  /* GPIO_DISP_B1_06 PAD functional properties : */
      0x06U);                                 /* PDRV Field: normal driver
                                                 Pull Down Pull Up Field: PU
                                                 Open Drain Field: Disabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_DISP_B1_07_VIDEO_MUX_LCDIF_DATA03,  /* GPIO_DISP_B1_07 PAD functional properties : */
      0x06U);                                 /* PDRV Field: normal driver
                                                 Pull Down Pull Up Field: PU
                                                 Open Drain Field: Disabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_DISP_B1_08_VIDEO_MUX_LCDIF_DATA04,  /* GPIO_DISP_B1_08 PAD functional properties : */
      0x06U);                                 /* PDRV Field: normal driver
                                                 Pull Down Pull Up Field: PU
                                                 Open Drain Field: Disabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_DISP_B1_09_VIDEO_MUX_LCDIF_DATA05,  /* GPIO_DISP_B1_09 PAD functional properties : */
      0x06U);                                 /* PDRV Field: normal driver
                                                 Pull Down Pull Up Field: PU
                                                 Open Drain Field: Disabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_DISP_B1_10_VIDEO_MUX_LCDIF_DATA06,  /* GPIO_DISP_B1_10 PAD functional properties : */
      0x06U);                                 /* PDRV Field: normal driver
                                                 Pull Down Pull Up Field: PU
                                                 Open Drain Field: Disabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_DISP_B1_11_VIDEO_MUX_LCDIF_DATA07,  /* GPIO_DISP_B1_11 PAD functional properties : */
      0x06U);                                 /* PDRV Field: normal driver
                                                 Pull Down Pull Up Field: PU
                                                 Open Drain Field: Disabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_DISP_B2_00_VIDEO_MUX_LCDIF_DATA08,  /* GPIO_DISP_B2_00 PAD functional properties : */
      0x08U);                                 /* Slew Rate Field: Slow Slew Rate
                                                 Drive Strength Field: normal driver
                                                 Pull / Keep Select Field: Pull Disable, Highz
                                                 Pull Up / Down Config. Field: Weak pull up
                                                 Open Drain Field: Disabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_DISP_B2_01_VIDEO_MUX_LCDIF_DATA09,  /* GPIO_DISP_B2_01 PAD functional properties : */
      0x08U);                                 /* Slew Rate Field: Slow Slew Rate
                                                 Drive Strength Field: normal driver
                                                 Pull / Keep Select Field: Pull Disable, Highz
                                                 Pull Up / Down Config. Field: Weak pull up
                                                 Open Drain Field: Disabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_DISP_B2_02_VIDEO_MUX_LCDIF_DATA10,  /* GPIO_DISP_B2_02 PAD functional properties : */
      0x08U);                                 /* Slew Rate Field: Slow Slew Rate
                                                 Drive Strength Field: normal driver
                                                 Pull / Keep Select Field: Pull Disable, Highz
                                                 Pull Up / Down Config. Field: Weak pull up
                                                 Open Drain Field: Disabled */
  IOMUXC_SetPinConfig(
